Revit 2024 API
Units Constructor
 Creates a new Units object with default settings for Metric or Imperial units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public Units(
	UnitSystem unitSystem
)
Visual Basic
Public Sub New ( _
	unitSystem As UnitSystem _
)
Visual C++
public:
Units(
	UnitSystem unitSystem
)
Parameters
unitSystem
Type: Autodesk.Revit.DB.UnitSystem
 Indicates whether the Units object should be initialized with default settings for Metric or Imperial units.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Units Class
Autodesk.Revit.DB Namespace